namespace Task3;

class Program
{
    static void Main(string[] args)
    {
        // a переменная для обозначения возраста человека, имеющая значение вашего возраста
        int age;
        age = 30; // Инициализируем возраст
        // b переменная, обозначающая ваше имя
        string name;
        name = "Егор"; // Инициализируем имя
        // c переменная для обозначения температуры за окном
        int outTemp;
        outTemp = 5; // Инициализируем температуру
        // d переменная логического типа, для обозначения пренадлежности к женскому полу, trye - женский пол, false - мужской
        bool isFemale;
        isFemale = true; // Инициализируем жениский пол
    }
}